Results/mongodb-consistency/load-continuous-normal-nearest-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
 10 sec: 21703 operations; 2162.51 current ops/sec; [INSERT AverageLatency(us)=745.5] 
 13 sec: 30000 operations; 2335.21 current ops/sec;   
[OVERALL], RunTime(ms), 13587.0
[OVERALL], Throughput(ops/sec), 2207.99293442261
[INSERT], Operations, 30000
[INSERT], AverageLatency(us), 12519.4559
[INSERT], MinLatency(us), 278
[INSERT], MaxLatency(us), 628633
[INSERT], Return=0, 29942
[INSERT], 0, 22143.103726708076
[INSERT], 1000, 11090.763773584906
[INSERT], 2000, 11033.431180968564
[INSERT], 3000, 9940.70573012939
[INSERT], 4000, 9305.9671155653
[INSERT], 5000, 12262.582487309644
[INSERT], 6000, 10864.158825610188
[INSERT], 7000, 10645.889949977261
[INSERT], 8000, 43667.568697729985
[INSERT], 9000, 9840.21309090909
[INSERT], 10000, 13666.530059271803
[INSERT], 11000, 12206.343812978637
[INSERT], 12000, 11198.944244604316
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 3248.366666666667
[CLEANUP], MinLatency(us), 1306
[CLEANUP], MaxLatency(us), 8315
[CLEANUP], 0, 3248.366666666667
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load