Results/mongodb-consistency/load-continuous-normal-primarypreferred-1.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
 10 sec: 23925 operations; 2382.26 current ops/sec;  
 12 sec: 30000 operations; 2528.09 current ops/sec;   
[OVERALL], RunTime(ms), 12446.0
[OVERALL], Throughput(ops/sec), 2410.412984091274
[INSERT], Operations, 30000
[INSERT], AverageLatency(us), 11513.328666666666
[INSERT], MinLatency(us), 300
[INSERT], MaxLatency(us), 581466
[INSERT], Return=0, 29946
[INSERT], 0, 25538.301577287068
[INSERT], 1000, 8731.519382288056
[INSERT], 2000, 11043.846530612245
[INSERT], 3000, 11787.897713097713
[INSERT], 4000, 7585.675608407079
[INSERT], 5000, 9837.78285077951
[INSERT], 6000, 15873.589603960396
[INSERT], 7000, 11624.744186046511
[INSERT], 8000, 11566.331269349845
[INSERT], 9000, 12808.467576791809
[INSERT], 10000, 10172.2243567753
[INSERT], 11000, 9856.416020671835
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2547.5666666666666
[CLEANUP], MinLatency(us), 836
[CLEANUP], MaxLatency(us), 4500
[CLEANUP], 0, 2547.5666666666666
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load