Results/mongodb-consistency/load-continuous-normal-primarypreferred-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
 10 sec: 25252 operations; 2517.15 current ops/sec; [INSERT AverageLatency(us)=13643.18] 
[OVERALL], RunTime(ms), 11943.0
[OVERALL], Throughput(ops/sec), 2511.9316754584274
[INSERT], Operations, 30000
[INSERT], AverageLatency(us), 10848.9223
[INSERT], MinLatency(us), 284
[INSERT], MaxLatency(us), 558337
[INSERT], Return=0, 29988
[INSERT], 0, 32804.7260034904
[INSERT], 1000, 8338.262965425532
[INSERT], 2000, 5854.084150131484
[INSERT], 3000, 9331.123310253874
[INSERT], 4000, 7668.62159887798
[INSERT], 5000, 11280.195652173914
[INSERT], 6000, 10276.05216752388
[INSERT], 7000, 14582.632019704433
[INSERT], 8000, 13066.14378730331
[INSERT], 9000, 14863.737028301886
[INSERT], 10000, 10462.656237929703
[INSERT], 11000, 7786.2414578587695
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2783.4
[CLEANUP], MinLatency(us), 969
[CLEANUP], MaxLatency(us), 6782
[CLEANUP], 0, 2783.4
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load